OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1615.h
#define _PID1K18                0x01
#define _K18                    0x01
#define _PID1K19                0x02
#define _K19                    0x02
#define _PID1K110               0x04
#define _K110                   0x04
#define _PID1K111               0x08
#define _K111                   0x08
#define _PID1K112               0x10
#define _K112                   0x10
#define _PID1K113               0x20
#define _K113                   0x20
#define _PID1K114               0x40
#define _K114                   0x40
#define _PID1K115               0x80
#define _K115                   0x80

//==============================================================================

extern __at(0x0592) __sfr PID1K2;

//==============================================================================
//        PID1K2L Bits

extern __at(0x0592) __sfr PID1K2L;

typedef union
  {
  struct
    {
    unsigned PID1K20            : 1;
    unsigned PID1K21            : 1;
    unsigned PID1K22            : 1;
    unsigned PID1K23            : 1;
    unsigned PID1K24            : 1;
    unsigned PID1K25            : 1;
    unsigned PID1K26            : 1;
    unsigned PID1K27            : 1;
    };

  struct
    {
    unsigned K20                : 1;
    unsigned K21                : 1;
    unsigned K22                : 1;
    unsigned K23                : 1;
    unsigned K24                : 1;
    unsigned K25                : 1;
    unsigned K26                : 1;
    unsigned K27                : 1;
    };
  } __PID1K2Lbits_t;

extern __at(0x0592) volatile __PID1K2Lbits_t PID1K2Lbits;

#define _PID1K20                0x01
#define _K20                    0x01
#define _PID1K21                0x02
#define _K21                    0x02
#define _PID1K22                0x04
#define _K22                    0x04
#define _PID1K23                0x08
#define _K23                    0x08
#define _PID1K24                0x10
#define _K24                    0x10
#define _PID1K25                0x20
#define _K25                    0x20
#define _PID1K26                0x40
#define _K26                    0x40
#define _PID1K27                0x80
#define _K27                    0x80

//==============================================================================


//==============================================================================
//        PID1K2H Bits

extern __at(0x0593) __sfr PID1K2H;

typedef union
  {
  struct
    {
    unsigned PID1K28            : 1;
    unsigned PID1K29            : 1;
    unsigned PID1K210           : 1;
    unsigned PID1K211           : 1;
    unsigned PID1K212           : 1;
    unsigned PID1K213           : 1;
    unsigned PID1K214           : 1;
    unsigned PID1K215           : 1;
    };

  struct
    {
    unsigned K28                : 1;
    unsigned K29                : 1;
    unsigned K210               : 1;
    unsigned K211               : 1;
    unsigned K212               : 1;
    unsigned K213               : 1;
    unsigned K214               : 1;
    unsigned K215               : 1;
    };
  } __PID1K2Hbits_t;

extern __at(0x0593) volatile __PID1K2Hbits_t PID1K2Hbits;

#define _PID1K28                0x01
#define _K28                    0x01
#define _PID1K29                0x02
#define _K29                    0x02
#define _PID1K210               0x04
#define _K210                   0x04
#define _PID1K211               0x08
#define _K211                   0x08
#define _PID1K212               0x10
#define _K212                   0x10
#define _PID1K213               0x20
#define _K213                   0x20
#define _PID1K214               0x40
#define _K214                   0x40
#define _PID1K215               0x80
#define _K215                   0x80

//==============================================================================

extern __at(0x0594) __sfr PID1K3;

//==============================================================================
//        PID1K3L Bits

extern __at(0x0594) __sfr PID1K3L;

typedef union
  {
  struct
    {
    unsigned PID1K30            : 1;
    unsigned PID1K31            : 1;
    unsigned PID1K32            : 1;
    unsigned PID1K33            : 1;
    unsigned PID1K34            : 1;
    unsigned PID1K35            : 1;
    unsigned PID1K36            : 1;
    unsigned PID1K37            : 1;
    };

  struct
    {
    unsigned K30                : 1;
    unsigned K31                : 1;
    unsigned K32                : 1;
    unsigned K33                : 1;
    unsigned K34                : 1;
    unsigned K35                : 1;
    unsigned K36                : 1;
    unsigned K37                : 1;
    };
  } __PID1K3Lbits_t;

extern __at(0x0594) volatile __PID1K3Lbits_t PID1K3Lbits;

#define _PID1K30                0x01
#define _K30                    0x01
#define _PID1K31                0x02
#define _K31                    0x02
#define _PID1K32                0x04
#define _K32                    0x04
#define _PID1K33                0x08
#define _K33                    0x08
#define _PID1K34                0x10
#define _K34                    0x10
#define _PID1K35                0x20
#define _K35                    0x20
#define _PID1K36                0x40
#define _K36                    0x40
#define _PID1K37                0x80
#define _K37                    0x80

//==============================================================================


//==============================================================================
//        PID1K3H Bits

extern __at(0x0595) __sfr PID1K3H;

typedef union
  {
  struct
    {
    unsigned PID1K38            : 1;
    unsigned PID1K39            : 1;
    unsigned PID1K310           : 1;
    unsigned PID1K311           : 1;
    unsigned PID1K312           : 1;
    unsigned PID1K313           : 1;
    unsigned PID1K314           : 1;
    unsigned PID1K315           : 1;
    };

  struct
    {
    unsigned K38                : 1;
    unsigned K39                : 1;
    unsigned K310               : 1;
    unsigned K311               : 1;
    unsigned K312               : 1;
    unsigned K313               : 1;
    unsigned K314               : 1;
    unsigned K315               : 1;
    };
  } __PID1K3Hbits_t;

extern __at(0x0595) volatile __PID1K3Hbits_t PID1K3Hbits;

