OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1615.h
#define _CWGINPPS0              0x01
#define _CWGINPPS1              0x02
#define _CWGINPPS2              0x04
#define _CWGINPPS3              0x08
#define _CWGINPPS4              0x10

//==============================================================================


//==============================================================================
//        T2PPS Bits

extern __at(0x0E18) __sfr T2PPS;

typedef union
  {
  struct
    {
    unsigned T2PPS0             : 1;
    unsigned T2PPS1             : 1;
    unsigned T2PPS2             : 1;
    unsigned T2PPS3             : 1;
    unsigned T2PPS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T2PPS              : 5;
    unsigned                    : 3;
    };
  } __T2PPSbits_t;

extern __at(0x0E18) volatile __T2PPSbits_t T2PPSbits;

#define _T2PPS0                 0x01
#define _T2PPS1                 0x02
#define _T2PPS2                 0x04
#define _T2PPS3                 0x08
#define _T2PPS4                 0x10

//==============================================================================


//==============================================================================
//        T3CKIPPS Bits

extern __at(0x0E19) __sfr T3CKIPPS;

typedef union
  {
  struct
    {
    unsigned T3CKIPPS0          : 1;
    unsigned T3CKIPPS1          : 1;
    unsigned T3CKIPPS2          : 1;
    unsigned T3CKIPPS3          : 1;
    unsigned T3CKIPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T3CKIPPS           : 5;
    unsigned                    : 3;
    };
  } __T3CKIPPSbits_t;

extern __at(0x0E19) volatile __T3CKIPPSbits_t T3CKIPPSbits;

#define _T3CKIPPS0              0x01
#define _T3CKIPPS1              0x02
#define _T3CKIPPS2              0x04
#define _T3CKIPPS3              0x08
#define _T3CKIPPS4              0x10

//==============================================================================


//==============================================================================
//        T3GPPS Bits

extern __at(0x0E1A) __sfr T3GPPS;

typedef union
  {
  struct
    {
    unsigned T3GPPS0            : 1;
    unsigned T3GPPS1            : 1;
    unsigned T3GPPS2            : 1;
    unsigned T3GPPS3            : 1;
    unsigned T3GPPS4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T3GPPS             : 5;
    unsigned                    : 3;
    };
  } __T3GPPSbits_t;

extern __at(0x0E1A) volatile __T3GPPSbits_t T3GPPSbits;

#define _T3GPPS0                0x01
#define _T3GPPS1                0x02
#define _T3GPPS2                0x04
#define _T3GPPS3                0x08
#define _T3GPPS4                0x10

//==============================================================================


//==============================================================================
//        T4PPS Bits

extern __at(0x0E1B) __sfr T4PPS;

typedef union
  {
  struct
    {
    unsigned T4PPS0             : 1;
    unsigned T4PPS1             : 1;
    unsigned T4PPS2             : 1;
    unsigned T4PPS3             : 1;
    unsigned T4PPS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T4PPS              : 5;
    unsigned                    : 3;
    };
  } __T4PPSbits_t;

extern __at(0x0E1B) volatile __T4PPSbits_t T4PPSbits;

#define _T4PPS0                 0x01
#define _T4PPS1                 0x02
#define _T4PPS2                 0x04
#define _T4PPS3                 0x08
#define _T4PPS4                 0x10

//==============================================================================


//==============================================================================
//        T5CKIPPS Bits

extern __at(0x0E1C) __sfr T5CKIPPS;

typedef union
  {
  struct
    {
    unsigned T5CKIPPS0          : 1;
    unsigned T5CKIPPS1          : 1;
    unsigned T5CKIPPS2          : 1;
    unsigned T5CKIPPS3          : 1;
    unsigned T5CKIPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T5CKIPPS           : 5;
    unsigned                    : 3;
    };
  } __T5CKIPPSbits_t;

extern __at(0x0E1C) volatile __T5CKIPPSbits_t T5CKIPPSbits;

#define _T5CKIPPS0              0x01
#define _T5CKIPPS1              0x02
#define _T5CKIPPS2              0x04
#define _T5CKIPPS3              0x08
#define _T5CKIPPS4              0x10

//==============================================================================


//==============================================================================
//        T5GPPS Bits

extern __at(0x0E1D) __sfr T5GPPS;

typedef union
  {
  struct
    {
    unsigned T5GPPS0            : 1;
    unsigned T5GPPS1            : 1;
    unsigned T5GPPS2            : 1;
    unsigned T5GPPS3            : 1;
    unsigned T5GPPS4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T5GPPS             : 5;
    unsigned                    : 3;
    };
  } __T5GPPSbits_t;

extern __at(0x0E1D) volatile __T5GPPSbits_t T5GPPSbits;

#define _T5GPPS0                0x01
#define _T5GPPS1                0x02
#define _T5GPPS2                0x04
#define _T5GPPS3                0x08
#define _T5GPPS4                0x10

//==============================================================================


//==============================================================================
//        T6PPS Bits

extern __at(0x0E1E) __sfr T6PPS;

typedef union
  {
  struct
    {
    unsigned T6PPS0             : 1;
    unsigned T6PPS1             : 1;
    unsigned T6PPS2             : 1;
    unsigned T6PPS3             : 1;
    unsigned T6PPS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T6PPS              : 5;
    unsigned                    : 3;
    };
  } __T6PPSbits_t;

extern __at(0x0E1E) volatile __T6PPSbits_t T6PPSbits;

