OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1615.h
#define _T6PPS0                 0x01
#define _T6PPS1                 0x02
#define _T6PPS2                 0x04
#define _T6PPS3                 0x08
#define _T6PPS4                 0x10

//==============================================================================


//==============================================================================
//        ATCC1PPS Bits

extern __at(0x0E1F) __sfr ATCC1PPS;

typedef union
  {
  struct
    {
    unsigned ATCC1PPS0          : 1;
    unsigned ATCC1PPS1          : 1;
    unsigned ATCC1PPS2          : 1;
    unsigned ATCC1PPS3          : 1;
    unsigned ATCC1PPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ATCC1PPS           : 5;
    unsigned                    : 3;
    };
  } __ATCC1PPSbits_t;

extern __at(0x0E1F) volatile __ATCC1PPSbits_t ATCC1PPSbits;

#define _ATCC1PPS0              0x01
#define _ATCC1PPS1              0x02
#define _ATCC1PPS2              0x04
#define _ATCC1PPS3              0x08
#define _ATCC1PPS4              0x10

//==============================================================================


//==============================================================================
//        SSPCLKPPS Bits

extern __at(0x0E20) __sfr SSPCLKPPS;

typedef union
  {
  struct
    {
    unsigned SSPCLKPPS0         : 1;
    unsigned SSPCLKPPS1         : 1;
    unsigned SSPCLKPPS2         : 1;
    unsigned SSPCLKPPS3         : 1;
    unsigned SSPCLKPPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSPCLKPPS          : 5;
    unsigned                    : 3;
    };
  } __SSPCLKPPSbits_t;

extern __at(0x0E20) volatile __SSPCLKPPSbits_t SSPCLKPPSbits;

#define _SSPCLKPPS0             0x01
#define _SSPCLKPPS1             0x02
#define _SSPCLKPPS2             0x04
#define _SSPCLKPPS3             0x08
#define _SSPCLKPPS4             0x10

//==============================================================================


//==============================================================================
//        SSPDATPPS Bits

extern __at(0x0E21) __sfr SSPDATPPS;

typedef union
  {
  struct
    {
    unsigned SSPDATPPS0         : 1;
    unsigned SSPDATPPS1         : 1;
    unsigned SSPDATPPS2         : 1;
    unsigned SSPDATPPS3         : 1;
    unsigned SSPDATPPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSPDATPPS          : 5;
    unsigned                    : 3;
    };
  } __SSPDATPPSbits_t;

extern __at(0x0E21) volatile __SSPDATPPSbits_t SSPDATPPSbits;

#define _SSPDATPPS0             0x01
#define _SSPDATPPS1             0x02
#define _SSPDATPPS2             0x04
#define _SSPDATPPS3             0x08
#define _SSPDATPPS4             0x10

//==============================================================================


//==============================================================================
//        SSPSSPPS Bits

extern __at(0x0E22) __sfr SSPSSPPS;

typedef union
  {
  struct
    {
    unsigned SSPSSPPS0          : 1;
    unsigned SSPSSPPS1          : 1;
    unsigned SSPSSPPS2          : 1;
    unsigned SSPSSPPS3          : 1;
    unsigned SSPSSPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSPSSPPS           : 5;
    unsigned                    : 3;
    };
  } __SSPSSPPSbits_t;

extern __at(0x0E22) volatile __SSPSSPPSbits_t SSPSSPPSbits;

#define _SSPSSPPS0              0x01
#define _SSPSSPPS1              0x02
#define _SSPSSPPS2              0x04
#define _SSPSSPPS3              0x08
#define _SSPSSPPS4              0x10

//==============================================================================


//==============================================================================
//        ATCC2PPS Bits

extern __at(0x0E23) __sfr ATCC2PPS;

typedef union
  {
  struct
    {
    unsigned ATCC2PPS0          : 1;
    unsigned ATCC2PPS1          : 1;
    unsigned ATCC2PPS2          : 1;
    unsigned ATCC2PPS3          : 1;
    unsigned ATCC2PPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ATCC2PPS           : 5;
    unsigned                    : 3;
    };
  } __ATCC2PPSbits_t;

extern __at(0x0E23) volatile __ATCC2PPSbits_t ATCC2PPSbits;

#define _ATCC2PPS0              0x01
#define _ATCC2PPS1              0x02
#define _ATCC2PPS2              0x04
#define _ATCC2PPS3              0x08
#define _ATCC2PPS4              0x10

//==============================================================================


//==============================================================================
//        RXPPS Bits

extern __at(0x0E24) __sfr RXPPS;

typedef union
  {
  struct
    {
    unsigned RXPPS0             : 1;
    unsigned RXPPS1             : 1;
    unsigned RXPPS2             : 1;
    unsigned RXPPS3             : 1;
    unsigned RXPPS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RXPPS              : 5;
    unsigned                    : 3;
    };
  } __RXPPSbits_t;

extern __at(0x0E24) volatile __RXPPSbits_t RXPPSbits;

#define _RXPPS0                 0x01
#define _RXPPS1                 0x02
#define _RXPPS2                 0x04
#define _RXPPS3                 0x08
#define _RXPPS4                 0x10

//==============================================================================


//==============================================================================
//        CKPPS Bits

extern __at(0x0E25) __sfr CKPPS;

typedef union
  {
  struct
    {
    unsigned CKPPS0             : 1;
    unsigned CKPPS1             : 1;
    unsigned CKPPS2             : 1;
    unsigned CKPPS3             : 1;
    unsigned CKPPS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CKPPS              : 5;
    unsigned                    : 3;
    };
  } __CKPPSbits_t;

extern __at(0x0E25) volatile __CKPPSbits_t CKPPSbits;

